# Microchip Technology Inc.
# Date: 2025-Sep-06 16:24:35
# This file was generated based on the following SDC source files:
#   C:/Mustafa/Courses&Learning/Microchip_FPGA-SoC_Training/RISC-V_for_PolarFire/Discovery_Mi-V_tutorial/PF_MiV_Tut/constraint/PROC_SUBSYSTEM_derived_constraints.sdc
#   C:/Mustafa/Courses&Learning/Microchip_FPGA-SoC_Training/RISC-V_for_PolarFire/Discovery_Mi-V_tutorial/PF_MiV_Tut/constraint/jtag_tck_constraint.sdc
#

create_clock -name {REF_CLK_0} -period 20 [ get_ports { REF_CLK_0 } ]
create_clock -name {TCK} -period 166.67 -waveform {0 83.33 } [ get_ports { TCK } ]
create_generated_clock -name {PF_CCC_C0_0/PF_CCC_C0_0/pll_inst_0/OUT0} -multiply_by 8 -divide_by 5 -source [ get_pins { PF_CCC_C0_0.PF_CCC_C0_0.pll_inst_0.REF_CLK_0 } ] [ get_pins { PF_CCC_C0_0.PF_CCC_C0_0.pll_inst_0.OUT0 } ]
set_clock_groups  -asynchronous -group [ get_clocks { PF_CCC_C0_0/PF_CCC_C0_0/pll_inst_0/OUT0 } ] -group [ get_clocks { TCK } ]
